In [1]:
import pandas as pd

# Lets start with Dictioary as Data Container

In [2]:
person={
    "first name":"Shibu",
    "last name":"Kumari",
    "email":"shibu123@gmail.com"
    
    
    
    
}
person

{'first name': 'Shibu', 'last name': 'Kumari', 'email': 'shibu123@gmail.com'}

# but here the Dictioary can store only one value for each key..
# Lets go with list of values for each key

In [3]:
people={
    "first name":["Vipul","Shibu","Simran",],
    "last name":["Kumar","Kumari","Kumari"],
    
    "email":["vipul@234@gmail.com","shibu123@gmail.com","simran123@gmail.com"]
}

# access values of a specific key

In [4]:
people['email']

['vipul@234@gmail.com', 'shibu123@gmail.com', 'simran123@gmail.com']

# problem with disctionary is: it has very limited functionlities.
# here lets go to pandas and its data-frames
# DataFrame:2-D data Structure(rows and columns)

# convert disctionary to DataFrame

In [5]:
df=pd.DataFrame(people)

In [6]:
df

  first name last name                email
0      Vipul     Kumar  vipul@234@gmail.com
1      Shibu    Kumari   shibu123@gmail.com
2     Simran    Kumari  simran123@gmail.com

# Access single column

In [7]:
df['email']

0    vipul@234@gmail.com
1     shibu123@gmail.com
2    simran123@gmail.com
Name: email, dtype: object

In [8]:
df['last name']

0     Kumar
1    Kumari
2    Kumari
Name: last name, dtype: object

In [9]:
df['first name']

0     Vipul
1     Shibu
2    Simran
Name: first name, dtype: object

# the above printed object is a series

# Series:1-d array (rows of a single column)

# DataFrame:Container for multiple series.

In [10]:
type(df['email'])

pandas.core.series.Series

# Access single column other way

In [11]:
df.email

0    vipul@234@gmail.com
1     shibu123@gmail.com
2    simran123@gmail.com
Name: email, dtype: object

# Access Multiple columns

In [12]:
df[['first name','last name']]

  first name last name
0      Vipul     Kumar
1      Shibu    Kumari
2     Simran    Kumari

# Knowing all columns of dataframe

In [13]:
df.columns

Index(['first name', 'last name', 'email'], dtype='object')

In [14]:
df

  first name last name                email
0      Vipul     Kumar  vipul@234@gmail.com
1      Shibu    Kumari   shibu123@gmail.com
2     Simran    Kumari  simran123@gmail.com

# To access rows loc and iloc are used

# loc:it is label-based.

# iloc:it is integer position-based

In [15]:
df.iloc[0]

first name                  Vipul
last name                   Kumar
email         vipul@234@gmail.com
Name: 0, dtype: object

In [16]:
df.iloc[1]

first name                 Shibu
last name                 Kumari
email         shibu123@gmail.com
Name: 1, dtype: object

# access multiple rows

In [17]:
df.iloc[[0,1]]

  first name last name                email
0      Vipul     Kumar  vipul@234@gmail.com
1      Shibu    Kumari   shibu123@gmail.com

## Rows of specific columns only

In [18]:
df.iloc[[0,1],2]

0    vipul@234@gmail.com
1     shibu123@gmail.com
Name: email, dtype: object

In [19]:
df.iloc[[0,1],[0,1]]

  first name last name
0      Vipul     Kumar
1      Shibu    Kumari

# now loc

In [20]:
df.loc[[0,1]]

  first name last name                email
0      Vipul     Kumar  vipul@234@gmail.com
1      Shibu    Kumari   shibu123@gmail.com

In [21]:
df.loc[[0,1],'email']

0    vipul@234@gmail.com
1     shibu123@gmail.com
Name: email, dtype: object

In [24]:
df.loc[[0,1],['email','last name']]

                 email last name
0  vipul@234@gmail.com     Kumar
1   shibu123@gmail.com    Kumari